[
    {
        "title": "Tesla Caps Roller-Coaster Year With Mixed Fourth-Quarter Earnings",
        "abstract": "The electric-car maker’s energy business lifted earnings but revenue generated by its core automotive business fell 8% for the quarter",
        "source": "WSJ",
        "date": "January 29, 2025",
        "content": "Tesla TSLA -4.79% decrease; red down pointing triangle Chief Executive Elon Musk talked about full self-driving cars hitting U.S. roads this year and the production of thousands of Optimus humanoid robots, after the automaker delivered mixed results in the fourth quarter.\n\nThe company reported declines in operating margin and automotive revenue for the period, with much of the growth coming from stronger demand for its energy-storage products and rising sales of regulatory credits.\n\nShares of Tesla rose 4% in after-hours trading Wednesday evening as Musk repeated his vision about Tesla becoming the world’s most valuable company because of its efforts now on robotics and self-driving vehicles.\n\nThe billionaire entrepreneur opened the electric-car maker’s earnings call with a focus on its future businesses, including its rollout of unsupervised autonomous vehicles in Austin in June, and an internal goal to build 10,000 Optimus humanoid robots by the end of the year.\n\n“We’re setting up for what I think will be an epic 2026 and a ridiculous ‘27 and ‘28—ridiculously good,” Musk said. \n\nRevenue was up 2% for the period, lifted by stronger demand for its energy-storage products and rising sales of regulatory credits. These credits, essentially pure profit for Tesla, are sold to other automakers that buy them to meet tailpipe-emissions requirements set by the U.S. government.\n\nBut for its core automotive business, revenue was down 8%, in part because Tesla leaned heavily on promotional deals in the fourth quarter to drive a rebound in sales in the last three months. Overall, Tesla’s closely watched operating margin was 6.2%, down from 8.2% a year earlier.\n\nTesla is facing an array of challenges in the year ahead, including a chief executive whose attention is divided by his other companies and work as an adviser to President Trump.\n\nIts core auto business is under pressure with demand weakening for its vehicles, including its new Cybertruck pickup, and intensifying competition in China, where a price war in the electric-car market has broken out among foreign and homegrown automakers.\n\nMusk’s close relationship with Trump only came up once on the call with Wall Street, when an analyst asked Musk what the right policy is to support sustainable transportation in the U.S. Musk largely avoided the question.\n\n“At this point, I think that sustainable transport is inevitable,” he said. \n\nWith growth stalled, investors are hopeful that more affordable electric-car options promised by Musk will help revive consumer interest in the brand.\n\nTesla Chief Financial Officer Vaibhav Taneja reiterated on Wednesday that the company plans to release new products this year, including a new low-cost model in the first half, though he didn’t provide specifics.\n\nIn October, Tesla showed off prototypes for two fully autonomous vehicles—the Cybercab, a gold two-seater with butterfly wing doors, and the Robovan, a 20-seater, art-deco style bus. Musk said the Cybercab could be available to customers for less than $30,000 with production starting by 2026. \n\nTesla’s market value skyrocketed to an all-time high of $1.5 trillion in December, powered by a postelection rally. The surge reflects optimism on Wall Street that Musk’s proximity to Trump will yield benefits for his businesses and help support Tesla’s ambitions in self-driving cars.\n\nAlong with advising Trump, Musk is leading the president’s new Department of Government Efficiency, a task force focused on reducing federal spending.\n\nTrump’s policy objectives, while backed by Musk, present some obstacles for Tesla’s car business. The president has pledged to roll back Biden-era subsidies for EVs, including a $7,500 tax consumer tax credit that has helped boost Tesla’s sales over the years.\n\nTrump is also threatening to impose a 25% tariff on Mexican and Canadian imports as soon as Saturday. While Tesla builds most cars it sells in the U.S. in Texas and California, it is reliant on suppliers in the two neighboring countries for parts. For instance, 20% to 25% of parts that are used in U.S.-built cars come from Mexico, according to federal data.\n\nOn Wednesday, Taneja said the tariffs are likely to impact Tesla’s profitability.\n\nTesla has fared better than some tech companies this week in a market selloff stoked by news from DeepSeek that it had released a powerful new AI model. The Chinese startup said its technology is particularly good at problem solving and can perform on par with OpenAI at a fraction of the cost.\n\nIn the near term, Tesla’s core automotive business is still critical to generating the profits behind Musk’s future AI and robotics bets. In its earnings release, Tesla said it plans to return to growth and increase production 60% in 2025.\n\nThe company last week unveiled a new updated version of its Model Y, one of the bestselling cars in the world. Consumer deliveries of the refreshed model are scheduled to begin in March."
    },
    {
        "title": "Tesla, BMW Sue EU as Tension Mounts on Chinese EV Tariffs",
        "abstract": "The companies join a growing band of Chinese automakers opposing punitive tariffs on electric vehicles",
        "source": "WSJ",
        "date": "January 27, 2025",
        "content": " Tesla TSLA -4.79%decrease; red down pointing triangle and Germany’s BMW BMW 1.75%increase; green up pointing triangle are suing the European Commission, joining a growing band of Chinese automakers to oppose the European Union on its punitive tariffs on electric vehicles.\n\nBoth Tesla Shanghai and BMW filed cases at the General Court of the European Union, the bloc’s second-highest court, according to its website.\n\nThe filings come after the EU slapped tariffs as high as 45% on Chinese EVs after it ruled that China is unfairly subsidizing the industry and saturating the bloc with cheaper cars. Tesla’s Chinese-manufactured EVs were hit with a 7.8% tariff while BMW’s cars from the country received a 20.7% markup.\n\nChinese manufacturers BYD, Geely and SAIC have also filed appeals in Luxembourg.\n\nA BMW spokesperson said the company opposes the import duties and said they don’t strengthen the competitiveness of European auto groups.\n\n“On the contrary, the countervailing duties harm the business model of globally active companies, they limit the supply of e-cars to European customers and can therefore even slow down decarbonization in the transport sector,” the spokesperson said, adding that the company would still prefer to negotiate an agreement.\n\n“As stated before, it is important to avoid a trade conflict that only has losers in the end,” BMW said.\n\nTesla didn’t immediately respond to a request for comment.\n\nEuropean Commission spokesperson Olof Gill said on Monday that the EU remains fully open to finding a negotiated solution, but that solution needs to address “the clear example of unfair competition that our investigation identified on this topic”.\n\nThe dispute is yet another battlefront for Tesla-owner Elon Musk, who has spent recent months panning the EU for its penchant for regulating tech giants. European regulators are also probing Musk’s X social network over suspected breaches of the Digital Services Act, an EU law forcing digital platforms to do more to tackle disinformation online.\n\nThe legal challenges, if successful, could annul the law that enabled Brussels to slap duties on Chinese products in the first place, and their owners could then fight to claim back losses."
    },
    {
        "title": "Tesla to Recall 1.2 Million Cars in China on Safety Concerns",
        "abstract": "The U.S. EV maker will deploy a software update for the affected vehicles remotely for free",
        "source": "WSJ",
        "date": "January 24, 2025",
        "content": "Tesla TSLA -4.79%decrease; red down pointing triangle China plans to fix 1.2 million China-made and imported vehicles with software issues as a dozen carmakers recalled vehicles over safety concerns in the world’s largest auto market.\n\nThe U.S. electric-vehicle giant recalled 335,716 vehicles, a mix of imported Model S and X and locally produced Model 3 and Y cars, over a potential malfunction of the rearview camera, China’s State Administration for Market Regulation said Friday.\n\nIt also recalled 871,087 Model 3 and Y cars made in China due to steering issues, the state market regulator said.\n\nThe EV maker will deploy a software update for the affected vehicles remotely for free, the SAMR said.\n\nTesla China recalled 1.6 million cars last January, its largest in the country, to fix issues with its driver-assistance features that could increase the risk of crashes.\n\nTesla has been facing tougher competition in China, where homegrown rivals, such as BYD, have tightened their grip on the country’s EV market. The U.S. automaker sold 93,766 China-made cars last month, ranking fifth in terms of car sales in China for December after falling out of the top three spots in October.\n\nXiaomi, an up-and-coming domestic player, recalled 30,931 vehicles over software issues that could affect its parking-assistance feature, the market regulator said in a separate statement.\n\nA dozen carmakers announced recall plans on Friday. The regulator regularly publishes vehicle recall information.\n\nBYD, China’s top carmaker, recalled 6,843 Bao 5 plug-in hybrid off-road SUVs from its premium brand Fangchengbao due to fire risk in China. Honda Motor’s Chinese joint ventures Dongfeng Honda and GAC Honda will recall a total of 1.37 million vehicles, effective Feb. 28."
    },
    {
        "title": "Why Auto Stocks Are Leading the Selloff",
        "abstract": "-",
        "source": "WSJ",
        "date": " February 3, 2025",
        "content": "Auto stocks—a convenient investor proxy for international trade—are at the heart of Monday’s global selloff.\n\nHonda led the rout in Asia, while in Europe shares in Volkswagen and Stellantis—the region’s largest automakers—were down roughly 6% in afternoon trading. General Motors fell 6% Monday morning, among the biggest faller in the S&P 500 index.\n\nMost automakers use Mexico and Canada to manufacture vehicles and parts for the large and lucrative U.S. market, making the industry among the biggest losers from the 25% tariffs President Donald Trump said would come into effect on Tuesday.\n\nGM assembles 63% of its North America production in the U.S., compared with 83% for Ford, meaning the Chevrolet maker is likely to be worse affected by the tariffs than its crosstown rival, according to Jefferies. Non-U.S. manufacturers are in a similar position to their Detroit peers, with 67% of North American vehicles assembled in the U.S. on average.\n\nMexico in particular has grown in recent years as a hub for making cheaper cars. For example, Volkswagen makes its Jetta sedan and Tiguan and Taos crossovers in Mexico for U.S. consumers, while manufacturing its full-size Atlas sports-utility vehicle in Chattanooga, Tenn.\n\nMercedes-Benz and BMW have factories in Mexico, but they also use the U.S. as a global hub for producing expensive sports-utility vehicles. BMW produces more vehicles in the U.S. than it sells in the country. Both stocks still fell roughly 4% Monday.\n\nShares of Porsche also slipped, even though it ships all its vehicles sold in the U.S. from Europe.\n\nInvestors are already anticipating the next steps in Trump's trade war. The President has singled out trade with the European Union for criticism, specifying cars in particular.\n\nIn 2023, Europe accounted for 23% of the roughly $250 billion U.S. deficit in auto vehicles and parts, not far behind Mexico and Canada with 34%.\n\nOne automaker that wouldn't be much affected by the tariffs is Tesla, whose Chief Executive Elon Musk has joined the new U.S. administration. Nonetheless, its stock was down 5% in morning trading."
    },
    {
        "title": "Trump’s Tariffs Would Hit Tesla’s Profits, Financial Chief Says",
        "abstract": "-",
        "source": "WSJ",
        "date": "January 29, 2025",
        "content": "President Trump’s proposed tariffs would hit Tesla’s profits, said Vaibhav Taneja, the electric-vehicle maker's chief financial officer.\n\n“Over the years, we've tried to localize our supply chain in every market, but we are still very reliant on parts from across the world for all our businesses,” Taneja said.\n\n“Therefore, the imposition of tariffs, which is very likely,” he said, “will have an impact on our business and our profitability.”\n\nTaneja didn’t say how large the impact would be. President Trump has talked about placing 25% tariffs on Mexico and Canada as soon as Saturday."
    },
    {
        "title": "As Trade War Looms, Tesla Hikes Prices in Canada Across Lineup",
        "abstract": "-",
        "source": "WSJ",
        "date": "January 23, 2025",
        "content": " Tesla is making a U-turn on its years of price cuts—at least in Canada.\n\nOn a banner across the top of its Canadian website, the company says it is hiking the price of its Model 3 by as much as $9,000 CAD on Feb. 1, the same date President Trump has threatened to impose tariffs on goods imported from Mexico and Canada. That’s about an $6,275 increase in U.S. dollars.\n\nThe electric-car maker, whose Chief Executive Elon Musk is a close adviser to Trump, is also increasing prices on three other models it sells in Canada but by a lesser amount of $4,000 CAD. Tesla didn’t immediately respond to a request for comment.\n\nThe price hikes come amid changing economic policies in Canada, including the end of a national electric-vehicle rebate program known as iZEV, which ran out of funds earlier this month. Canada previously offered EV buyers $5,000 to purchase Tesla models under a certain price point, on top of some regional incentives.\n\nTrump said on Monday he aims to implement a 25% tariff on imports from Canada and Mexico starting on Feb. 1. It's unclear whether Canada will respond with retaliatory tariffs, which increase the cost of products imported from the U.S. to Canada"
    },
    {
        "title": "Tesla Stock Looks To Advance After Tariffs Sell Off. But It's No Longer A 'Top Pick.'",
        "abstract": "-",
        "source": "Kit Norton",
        "date": "February 4, 2025",
        "content": "Tesla (TSLA) stock on Tuesday shook off some of its tariffs-related losses from Monday as President Donald agreed to month-long reprieves for both Canada and Mexico. Meanwhile, TSLA consolidated in January with 2025 earnings consensus estimates plummeting 11% following Q4 earnings last week. \n\nMany stocks, including Tesla, were hit hard on Monday on the Trump tariff news. However, late Monday, Canadian Prime Minister Justin Trudeau announced a $1.3 billion border plan that will pause Trump's tariffs for at least 30 days. Midday Monday, Trump granted Mexico a one-month reprieve from 25% tariffs that were set to take effect Tuesday, after Mexican President Claudia Sheinbaum committed to send 10,000 troops to the border to halt drug trafficking.\n\nU.S. tariffs on China went into effect Tuesday and China has retaliated with tariffs on U.S. crude oil, liquefied natural gas, coal and other commodities.\n\nTroy Teslike, whose delivery estimates and Tesla data tracking are highly respected among retail Tesla investors, on Feb. 2 posted to X that based on the company's current battery supply, he doesn't \"see any immediate problems due to Trump's trade war with Mexico, Canada and China.\"\n\n\"If Trump starts a trade war with Japan, it would impact Tesla's Model S and Model X production in the U.S.,\" Teslike wrote.\n\nTSLA rose around 2.3% to 392.40 during market action on Tuesday.\n\nShares tumbled 5.2% to 383.68 on Monday, falling below the 50-day moving average. Tesla flirted with an early entry Friday.\n\nThe Tesla Cybertruck late Monday also officially began to qualify for the full $7,500 Inflation Reduction Act, or IRA, tax credit. Trump has signaled EV tax credits could be stripped out of the IRA. The Cybertruck starting price with the tax credit is around $72,490.\n\nTesla Not A 'Top Pick'\n\nPrior to Trump's tariff policy dominating the news cycle, Tesla Q4 earnings missed Wednesday night, even with a Bitcoin gain, with core auto margins hitting a multiyear low. However, Chief Executive Elon Musk was extremely bullish on the earnings call. He said he expects Tesla to start paid robotaxi rides in Austin.\n\nMorgan Stanley analyst Adam Jonas, a longtime Tesla bull, late on Friday removed the firm's \"top pick\" designation for TSLA. Jonas maintained a 430 price target and an overweight rating on the shares. Following earnings, Jonas wrote the results were \"mostly disappointing,' but added that the report was not 'particularly narrative changing.\"\n\nMusk appeared to signal that 2025 could be another middling year for the EV giant, with only slight vehicle sales growth, as much of the conference call highlighted the possibility for incredible things to come in 2026, 2027 and 2028. As a result, analyst 2025 profit estimates have been coming down since Wednesday.\n\nAs of Tuesday, Tesla's 2025 EPS is expected to come in at $2.95, down 11% from the $3.31 expectation prior to Q4 earnings, according to FactSet. Estimates for 2026 have come down significantly as well.\n\nTesla annual earnings are now not forecast to rise above the 2002 peak of $4.07 per share until 2027, according to FactSet.\n\nTesla Stock Performance\n\nTSLA is has a base with a traditional 488.54 buy point, the record high from Dec. 18, according to MarketSurge charts. The stock is about 27% below that entry.\n\nLast week, Tesla stock edged down 0.5% to 404.60 after briefly flashing an early entry Friday. The EV giant came right up to a downward-sloping trendline on Friday, paring gains on Trump tariff news.\n\nIt's possible that Tesla's retreat from Friday's highs and Monday's slide reflected an ongoing re-evaluation of Tesla's earnings report and conference call.\n\nA move above Friday's intraday high of 419.99 could offer an early entry. Investors also could use the Jan. 17 high of 439.74 to enter Tesla stock.\n\nTSLA stock is on the IBD Leaderboard watchlist. For this afternoon's earnings, the Musk-led earnings call will be the focus, as usual.\n\nThe stock consolidated in January, pausing after a scorching hot fourth quarter where Tesla stock logged most of its 63% advance for 2024, especially after Trump's election win.\n\nTesla stock ranks first in the 35-stock IBD Auto Manufacturers industry group. The stock has a 91 Composite Rating out of a best-possible 99. Shares also have a 97 Relative Strength Rating and an 84 EPS Rating."
    },
    {
        "title": "Tesla stock rises after company pledges return to growth after Q4 results disappoint",
        "abstract": "-",
        "source": "Yahoo Finance",
        "date": "January 30, 2025",
        "content": "Tesla (TSLA) pledged a return to growth in 2025 on Wednesday after fourth quarter results disappointed, capping off a year that saw revenue rise just 1% while profits fell sharply from a year ago. On the earnings call, Tesla CEO Elon Musk said that paid, unsupervised FSD (Full Self-Driving) is coming to Austin, Texas, in June.\n\nShares in the electric vehicle maker jumped nearly 4% in early trading on Thursday.\n\n\"With Unsupervised FSD expected to be available throughout the US by the end of 2025 and the rest of the world by the end of 2026 this will be a focus of the bulls,\" Wedbush analyst Dan Ives wrote on Thursday morning.\n\nFor the fourth quarter, Tesla reported revenue of $25.7 billion, well short of the $27.2 billion expected by analysts and up just 2% from a year ago. For the full year 2024, revenue rose 1% to $97.7 billion.\n\nAdjusted earnings per share came in at $0.73, less than the $0.75 Wall Street analysts were forecasting, according to Bloomberg data.\n\nOperating income totaled $1.58 billion, down 23% from last year, while adjusted net income rose 3% to $2.6 billion.\n\nTesla said its operating income was negatively impacted by costs associated with artificial intelligence and other R&D projects, as well as lower average selling prices for its current vehicles.\n\nIn its shareholder presentation, Tesla said it expects its auto business to return to growth in 2025 after total auto revenues fell 8% in the fourth quarter compared to last year and 6% in 2024 compared to 2023. Total auto production fell 7% in the fourth quarter while deliveries rose 2%.\n\n\"In terms of both growth and profitability, results missed consensus expectations and the outlook was relatively lacking in detail — calling for a 'return to growth' for the vehicle business (vs. consensus expectation for low teens YoY growth),\" Morgan Stanley analyst Adam Jonas wrote after the earnings were released. \"There was no reference to Elon Musk's prior mention of 20% to 30% volume growth for 2025.\"\n\nEarlier this month, Tesla said it delivered 495,930 vehicles globally in 2024, missing analyst estimates of around 510,400. In 2024, Tesla delivered 1.78 million vehicles, a 1% drop from the prior year and marking the company's first year-over-year decline, suggesting new competition, demand, and global economic conditions may be hurting the company.\n\nTesla said in a Thursday filing that it expects capital spending to surpass $11 billion this year and in the next two fiscal years.\n\nIn October, the company had projected spending between $8 billion and $10 billion in 2026.\n\nThe company also said plans for new vehicles and their production would result in \"less cost reduction\" than it had previously anticipated, but said using both its current and next-gen platforms on the same manufacturing lines \"enables us to prudently grow our vehicle volumes in a more capex efficient manner during uncertain times.\"\n\nTesla CFO Vaibhav Taneja said on a call with analysts that Model Y production will be shut down across its factories for a short time as the new Model Y changeover occurs and that the shutdown will impact margins.\n\nThe company reiterated that plans for new vehicles, including \"more affordable models,\" were on track to start production in the first of 2025. Tesla also said its purpose-built robotaxi, the Cybercab, is still scheduled for volume production in 2026, with fleet-testing of existing models happening \"later this year.\"\n\nTesla said vehicle volume this year is expected to return to growth due to advancements in vehicle autonomy and the launch of new products. The company plans to launch FSD in Europe and China in 2025.\n\nTesla's energy storage business remains a bright spot for the company, with energy deployments expected to grow 50% year over year.\n\nThe company's stock closed out 2024 on a Trump-fueled election win as Musk became one of Trump's staunchest allies during the campaign and maintains a significant role in the Trump administration.\n\nAsked on Wednesday's call about his role in the administration and helping push forward US industrial policy, Musk said, \"In general, we need to make manufacturing cool again in America ... We have too much talent in law and finance in America, and there should be more of that talent in manufacturing.\""
    },
    {
        "title": "Why Tesla (TSLA) Shares Are Trading Lower Today",
        "abstract": "-",
        "source": "StockStory",
        "date": "February 3, 2025",
        "content": "What Happened?\n\nShares of electric vehicle pioneer Tesla (NASDAQ:TSLA) fell 7.1% in the morning session after the Trump administration's new tariffs (25% on Canadian goods and 10% on Chinese products) shook markets.\n\nWhile similar tariffs were set for Mexico, they have been delayed. But it doesn't help that Canada has already hit back with its levies on U.S. imports. Also, Canada's Former Finance Minister Chrystia Freeland, who is campaigning to replace prime minister Justin Trudeau), called for a 100% tariff on Tesla. President Trump noted in a social media post that Americans might feel the sting: \"WILL THERE BE SOME PAIN? YES, MAYBE (AND MAYBE NOT!).\" The tariffs were imposed as part of measures to improve the U.S.'s trade gap with the rest of the world and also to tighten border security.\n\nThe auto industry stands in the crosshairs. Notably, Tesla builds some of its cars with parts from Canada and Mexico. Tariffs could drive up costs, making cars more expensive from the factory to the dealership.\n\nSeparately, there are reports Tesla is losing ground in Sweden and Norway. According to Reuters, registration numbers for Teslas in Sweden fell 44% in January 2025, while in Norway, they dropped 38% compared to the previous year.\n\nThe shares closed the day at $383.85, down 5.1% from previous close.\n\nThe stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks. Is now the time to buy Tesla?\n\nWhat The Market Is Telling Us\n\nTesla’s shares are extremely volatile and have had 110 moves greater than 2.5% over the last year. In that context, today’s move indicates the market considers this news meaningful but not something that would fundamentally change its perception of the business.\n\nThe previous big move we wrote about was 5 days ago when the stock gained 6.5%. As is usually the case, the quarter had something for the bulls and something for the bears.\n\nOn the bullish side, the company reiterated its promise to investors to launch its unsupervised full self-driving (FSD) and Robotaxi businesses later this year. Aside from the short-term results, those excited about the stock continue to argue that quarterly results are less relevant for a company that will revolutionize areas such as energy and humanoid robots.\n\nFor the bears, the results themselves provided fodder. Revenue and operating income both fell short of Wall Street's estimates. These misses were driven by underperformance in its Automotive and Energy segments, as Services (which includes full self-driving) actually beat analysts' revenue expectations. However, Services is Tesla's lowest margin business line - it had an extremely bad gross margin of 5.8% for the trailing 12 months, and it fell to 4.2% this quarter.\n\nOverall, this is a mixed quarter, and despite these challenges, the market seems to be holding faith in Tesla's long-term vision thus far.\n\nTesla is up 1.4% since the beginning of the year, but at $384.48 per share, it is still trading 19.9% below its 52-week high of $479.86 from December 2024. Investors who bought $1,000 worth of Tesla’s shares 5 years ago would now be looking at an investment worth $7,394."
    },
    {
        "title": "Analysts overhaul Tesla stock price targets after Q4 earnings",
        "abstract": "-",
        "source": "TheStreet",
        "date": "January 30, 2025",
        "content": "Tesla shares bumped higher in early Thursday trading after its disappointing fourth quarter earnings update was somewhat offset by a bullish outlook from CEO Elon Musk, triggering a host of price-target changes from Wall Street analysts.\n\nTesla shares  (TSLA)  have added around $530 billion in market value since late October and have been seen as one of the key beneficiaries of President Donald Trump's election in November as the company continues its pivot from its legacy automaking business to a focus on self-driving technologies, energy storage and robotics.\n\nIts core EV business, meanwhile, has suffered from high interest rates and lagging demand, with last year's vehicle deliveries falling for the first time on record and profit margins narrowing because of price cuts and financing incentives.\n\nTela posted weaker-than-expected fourth quarter revenues of $25.71 billion, about $2 billion shy of Wall Street forecasts, with profits of 73 cents a share that also missed estimates.\n\nMusk, however, was characteristically upbeat in his conference call with investors and analysts following last night's results and reiterated plans to launch a low-cost EV later this year and to put the first fully autonomous Tesla cars on the road by this spring.\n\nMusk predicts 'ridiculously good' growth\n\n\"We're setting up for what I think will be an epic 2026 and a ridiculous 2027 and 2028 ... ridiculously good,\" Musk said.\n\n\"Very few people understand the value of self-driving and our ability to monetize the fleet,\" he added. \"Some of these things I've said for quite a long time, and I know people have said, 'Well, Elon, the boy who cried wolf several times.' But I'm telling you, there's a damn wolf this time and you can drive it.\"\n\nTesla also said it expected its auto business to return to growth, although Musk did not repeat his earlier estimates of a 20% to 25% gain in deliveries.\n\nRelated: Analyst overhauls Tesla stock price target with Q4 earnings in focus\n\n\"Despite the miss, and backing off its prior 2025 vehicle sales-growth guidance, [the] shares jumped after hours as we believe the market is focused more on its expectation that Tesla aims to launch unsupervised Full Self-Driving in parts of the U.S. later in 2025,\" said CFRA analyst Garrett Nelson.\n\nHe trimmed his price target by $10 to $540 per share following last night's update. \"We reiterate our 'buy' rating, with Tesla as one of the primary beneficiaries of a more accommodating regulatory environment in the U.S.,\" he added.\n\nTesla could lead AI's real-world advance\n\nMorgan Stanley's Adam Jonas, who reiterated his 'overweight' rating and $430 price target on Tesla stock, called the earnings report \"emblematic of a company in the transition from an automotive 'pure play' to a highly diversified play on AI and robotics.\"\n\n\"As AI moves from the digital world (bits and bytes) to the physical world (atoms and photons), we expect to see Tesla’s total-addressable-market aperture further expand to broader domains, many of which are still not included in buy-side or sell-side financial models for the company,\" Jonas argued.\n\n\"While the journey may be volatile and nonlinear, we believe 2025 will be a year where investors will continue to appreciate and value these existing and nascent industries of embodied AI where we believe Tesla has established a material competitive advantage,\" he added.\n\nRelated: Top analyst reworks Tesla stock price, rating with Q4 earnings on deck\n\nThat was echoed, albeit more cautiously, by UBS analyst Joseph Spak, who maintained his sell rating on the stock but nonetheless lifted his price target to $259 a share from $226.\n\n\"We continue to be impressed with Tesla’s initiatives and the progress they are making on full self-driving and Optimus\" robots, he said. \"Our challenge remains that the actual numbers and more easily identifiable forecasts relate to auto and energy.\"\n\n\"While we do agree Tesla has as good an opportunity as anyone to achieve and capitalize on these goals, more investors we speak to acknowledge there is still technology and execution risk as well as timing uncertainty (certainly with Optimus),\" he added.\n\nTesla capital spending tops $11 billion\n\nTesla said its 2025 capital outlays are likely to rise to $11 billion, and remain at about that level in 2026 and 2027, as it expands and develops both its manufacturing platforms as well as the AI technologies needed to power its FSD and robotics ambitions.\n\n\"If you are a bull and believer in the AI autonomous vision for Tesla this morning,  you feel even more confident in its thesis.\" said Wedbush analyst Dan Ives, who affirmed his outperform rating and $550 price target.\n\n\"We believe the autonomous/AI piece is 90% of the Tesla story today and thus speaks to our $2 trillion valuation thesis for Tesla over the coming 12 to 18 months,\" he added.\n\nTruist Securities analyst William Stein cautioned, however, that there has been \"too much cheerleading\" and not enough \"ground-truth\" in the Tesla story, adding that investors will need more detail on Musk's broader product road map.\n\nStein kept his hold rating in place but lifted his Tesla price target by $22 to $373 per share.\n\nPiper Sander analyst Alexander Potter was also cautious, leaving his 'overweight' rating and $500 price target unchanged following last night's update. But he noted that Tesla's commentary \"has never been so unabashedly bullish.\"\n\n\"This is a pivotal year for Tesla,\" Musk said. \"And when we look back on 2025 and the launch of unsupervised Full Self-Driving, true real-world AI that actually works ... I think it probably will be viewed as maybe the most important year in Tesla's history.\"\n\n\"There is no company in the world that is as good in real-world AI as Tesla,\" he added.\n\nTesla shares closed 2.87% higher at $400.28 each Thursday, a move that extended the stock's January gain to around 5.5%."
    }
]